In [2]:
import pandas as pd
import numpy as np

In [3]:
data=np.arange(5)
data

array([0, 1, 2, 3, 4])

In [7]:
a=pd.Series(data,index=['a','b','c','d','e'])
a

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [8]:
a['b']

1

In [9]:
#산술연산
a

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [10]:
a+10
a-10

a   -10
b    -9
c    -8
d    -7
e    -6
dtype: int64

In [11]:
#집계함수
a.add(10)

a    10
b    11
c    12
d    13
e    14
dtype: int64

In [14]:
#dataframe
rawData=np.random.randint(50,100,size=(4,3))
rawData

array([[75, 66, 60],
       [94, 60, 54],
       [69, 66, 81],
       [65, 75, 55]])

In [16]:
df=pd.DataFrame(rawData,index=['1반','2반','1반','2반'],
                columns=['국','영','수'])
df

     국   영   수
1반  75  66  60
2반  94  60  54
1반  69  66  81
2반  65  75  55

In [17]:
df['국']

1반    75
2반    94
1반    69
2반    65
Name: 국, dtype: int64

In [23]:
df['평균']=round((df['국']+df['영']+df['수'])/3,2)
df

     국   영   수     평균
1반  75  66  60  67.00
2반  94  60  54  69.33
1반  69  66  81  72.00
2반  65  75  55  65.00

In [24]:
df['na']=np.nan
df

     국   영   수     평균  na
1반  75  66  60  67.00 NaN
2반  94  60  54  69.33 NaN
1반  69  66  81  72.00 NaN
2반  65  75  55  65.00 NaN

In [30]:
df[df.평균>70]

     국   영   수    평균
1반  69  66  81  72.0

In [34]:
#결측값 처리
df=df.astype('float64')
df

       국     영     수
1반  75.0  66.0  60.0
2반  94.0  60.0  54.0
1반  69.0  66.0  81.0
2반  65.0  75.0  55.0

In [37]:
df['수'][2]=np.nan
df

       국     영     수
1반  75.0  66.0  60.0
2반  94.0  60.0  54.0
1반  69.0  66.0   NaN
2반  65.0  75.0  55.0

In [40]:
df.dropna(axis=1) #nan값의 행(0)이 사라짐 원본은변형x inplace=True 은 원본변형

       국     영
1반  75.0  66.0
2반  94.0  60.0
1반  69.0  66.0
2반  65.0  75.0

In [41]:
df.fillna('hello')

       국     영      수
1반  75.0  66.0     60
2반  94.0  60.0     54
1반  69.0  66.0  hello
2반  65.0  75.0     55

In [43]:
df.fillna('mean')

       국     영     수
1반  75.0  66.0    60
2반  94.0  60.0    54
1반  69.0  66.0  mean
2반  65.0  75.0    55

In [44]:
#Multiindex
df.T #행 열 바꿔주기

     1반    2반    1반    2반
국  75.0  94.0  69.0  65.0
영  66.0  60.0  66.0  75.0
수  60.0  54.0   NaN  55.0

In [46]:
df.index=[['1학년','1학년','2학년','2학년'],['1반','2반','1반','2반']]
df

           국     영     수
1학년 1반  75.0  66.0  60.0
    2반  94.0  60.0  54.0
2학년 1반  69.0  66.0   NaN
    2반  65.0  75.0  55.0

In [48]:
df.columns=[['언어','언어','수리'],['국','영','수']]
df

          언어          수리
           국     영     수
1학년 1반  75.0  66.0  60.0
    2반  94.0  60.0  54.0
2학년 1반  69.0  66.0   NaN
    2반  65.0  75.0  55.0

In [50]:
df['언어']['국']

1학년  1반    75.0
     2반    94.0
2학년  1반    69.0
     2반    65.0
Name: 국, dtype: float64

In [51]:
#데이터사전 분석
df

          언어          수리
           국     영     수
1학년 1반  75.0  66.0  60.0
    2반  94.0  60.0  54.0
2학년 1반  69.0  66.0   NaN
    2반  65.0  75.0  55.0

In [52]:
df.info() #기본적인 정보

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 4 entries, ('1학년', '1반') to ('2학년', '2반')
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   (언어, 국)  4 non-null      float64
 1   (언어, 영)  4 non-null      float64
 2   (수리, 수)  3 non-null      float64
dtypes: float64(3)
memory usage: 328.0+ bytes

In [53]:
df.head() #맨처음 데이터5개

          언어          수리
           국     영     수
1학년 1반  75.0  66.0  60.0
    2반  94.0  60.0  54.0
2학년 1반  69.0  66.0   NaN
    2반  65.0  75.0  55.0

In [54]:
df.tail()#데이터 맨마지막 5개

          언어          수리
           국     영     수
1학년 1반  75.0  66.0  60.0
    2반  94.0  60.0  54.0
2학년 1반  69.0  66.0   NaN
    2반  65.0  75.0  55.0

In [55]:
df.dtypes

언어  국    float64
    영    float64
수리  수    float64
dtype: object

In [56]:
df.describe()

              언어                    수리
               국          영          수
count   4.000000   4.000000   3.000000
mean   75.750000  66.750000  56.333333
std    12.841988   6.184658   3.214550
min    65.000000  60.000000  54.000000
25%    68.000000  64.500000  54.500000
50%    72.000000  66.000000  55.000000
75%    79.750000  68.250000  57.500000
max    94.000000  75.000000  60.000000

In [58]:
df.isnull()

           언어            수리
            국      영      수
1학년 1반  False  False  False
    2반  False  False  False
2학년 1반  False  False   True
    2반  False  False  False

In [59]:
df.isnull().sum() #결측치가 몇개있는지

언어  국    0
    영    0
수리  수    1
dtype: int64

In [63]:
#값의 연결
a=pd.DataFrame(np.arange(1,10).reshape(3,3))
a

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [64]:
b=pd.Series(np.arange(10,40,10))
b

0    10
1    20
2    30
dtype: int64

In [65]:
pd.concat([a,b],axis=1) #a와 b를 합칠껀데 축을 1로줘야 열로합쳐짐

   0  1  2   0
0  1  2  3  10
1  4  5  6  20
2  7  8  9  30

In [66]:
pd.concat([a,b],axis=1,ignore_index=True) #3으로 바꾸고싶을때

   0  1  2   3
0  1  2  3  10
1  4  5  6  20
2  7  8  9  30

In [67]:
a.append(b,ignore_index=True) #행으로 추가하고싶을때

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  20  30